{
  /*
Array.prototype.every() – এই মেথডটি একটি অ্যারের প্রত্যেকটি ভ্যালুকে একটি কন্ডিশন অনুযায়ী চেক করে এবং কন্ডিশনটি যদি সবার ক্ষেত্রে সত্য হয় তাহলে সে true রিটার্ন করে আর কোন এক জনের জন্য কন্ডিশনটি মিথ্যা হলে সে false রিটার্ন করে। বিষয়টি একটি ছোট্ট উদাহরণের মাধ্যমে দেখে নিই। মনে করুন আমাদের কাছে একটি অ্যারে আছে আর সেই অ্যারের প্রত্যেকটি উপাদান বিজোড় কিনা আমরা সেটা যাচাই করবো every() মেথড দিয়ে।
*/
}

const isEven = (num) => num % 2;
let arr = [29, 13, 71, 30, 55];
console.log(arr.every(isEven)); // false
